{
  "doc_name": "Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
  "max_score": 0.6176263093948364,
  "hits": [
    {
      "text": "Position Title: - Manager (Development)\nReport To: - | Chief Technology Officer (CTO)\nWing: - | IT & Communication\nPurpose of the Position:\nResponsible for maximizing the productivity / performance of IT Applications / Custom Developed Software / Web Portals by directing the daily, weekly, and monthly activities. To provide leadership, motivation, training, and development of the workforce; process and procedure development to achieve operational excellence. Areas of Responsibilities:\n To create and document a conceptual and detailed design and write a code based on conceptual description of the business logic.  To design and development of database components as per requirement of software.  To compile and write documentation of software development and subsequent revisions inserting comments in the coded instructions.  To facilitate operational and technical personnel to clarify program inten t, identify problems, suggest, and implement changes.  To assist Business, Operational & Financial teams to define and resolve problems in running software applications/programs as per the software requirement specification.\n To maintain confidentiality with | regards to the information being processed, stored or\naccessed.  To test the developed application/component in the UAT/Test environments and deployed on Production.  Prepares and installs solutions by determining and designing system specifications, standards, and programming.  Maintenance of the systems once they are up and running.  Work on Special Projects/Assignments as and when needed by the organization.  Partner with cross-functional teams (UX, Data, Security) for seamless integration.  Implement DevOps practices (CI/CD, automation, monitoring).  Ensure scalability, security, and performance of software solutions.  Collaborate with Product Management, QA, DevOps, and other stakeholders to align priorities.  Ensure adherence to Agile/Scrum or other development methodologies.  Any other duty / assignment assigned by the Sr. Manager. Qualification and Experience:\ni Bachelor’s degree (Hons) in IT, Computer Sciences or Software Engineering or any | other\nrelevant / | similar degree from a recognized University; and\n 5 years’ post qualification experience in the relevant field including at least four years’\nexperience in public sector along with 2 years ’ experience | in Application Development\nOperations, System Integrations, Business Dashboards, Business Intelligence (ETL to Report Designing), Databases Administration. Note: Experience in private entities shall be accepted if such entity is registered with SECP, Registrar of Firms or any other Public Sector Regulatory Authority. Competencies & Personal Attributes:\n Dot Net Core, MVC Entity Framework, SQL Server, Rest API, Angular JS / + AJAX, Bootstrap, Power BI, C#, WCF/REST services, multi-Threading.  Work on elements of SDLC life cycle (Build, design, development, deployment)  Experience of Microsoft Azure and other cloud services.  Experience in writing backend components and Restful APIs.  Develop technical interfaces, specifications, and architecture.  Third Party Components Telerik / Dev Express / Crystal Report / RDLC.  Strong knowledge of API lifecycle management platforms.  Good command on Microsoft SQL Server stored procedure, views, Functions, database ERP architecture, query optimization.  Knowledge of technologies like Node JS, React JS, Mongo DB Appointment:",
      "score": 0.6176263093948364,
      "page_start": 347,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": false
    },
    {
      "text": "THE PUNJAB ENFORCEMENT AND REGULATORY AUTHORITY (EFFICIENCY & DISCIPLINE) REGULATIONS, 2025 CONTENTS\n\n1. Short title and Commencement\n2. Definitions\n3. Grounds for Proceedings\n4. Penalties\n5. Suspension\n\nChapter-I: Disciplinary Procedure for Regular Employees of the Authority\n\n6. Types of Proceedings\n7. Procedure of Departmental Inquiry\n8. Power of Inquiry Officer or Inquiry Committee\n9. Order to be Passed by the Competent Authority\n10. Departmental Appeal\n11. Revision\n\nChapter II: Disciplinary Procedure for Contractual Employees\n\n12. Procedure for Proceedings against Contractual Employees\n\nChapter III: Disciplinary Procedure for Deputationists\n\n13. Procedure for Deputationists\n\nChapter IV: | Miscellaneous\n\n14. Appearance of Counsel\n15. Indemnity\n\nSCHEDULE\n\nSchedule-I | - Competent and Appellate Authorities for Employees of Directorate\nGeneral\n\nSchedule-I | - Competent and Appellate Authorities for Employees of Enforcement\nStation",
      "score": 0.5626767873764038,
      "page_start": 402,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": false
    },
    {
      "text": "compensation for agility and expertise, and deputationists maintain their established remuneration with a small incentive. The HR and Finance Departments ensure that all salary payments are accurate, timely, and as per the sanctioned terms of appointment. 6.2 Annual Salary Increment PERA grants annual salary increments to reward employees for their continued service and to adjust for increased experience and seniority. The policy on annual increments differs slightly for different categories: • Regular (BPS) Employees & Deputationists: They will be entitled to adhoc increment as announced by Govt. of Punjab in annual budget. Further, annual increment admissible in December will be allowed strictly as per instructions of Govt. of Punjab. | • Contract Employees: Annual salary increment for contractual employees will be governed in the light of Regulation 16 of PERA (Performance Appraisal) Regulations, 2025. | All increments and pay increases are subject to budget availability and any instructions by the Finance Department. PERA will budget for annual increments as part of its yearly budgeting exercise. | In essence, annual increments serve to reward tenure and adjust pay for increased service. PERA adheres to the standardized approach for regular staff and endeavors to fairly extend similar treatment to contractual staff to maintain equity and motivation across the organization. 6.3 Gratuity The contractual employees of the Authority will be entitled to gratuity equal to one salary at the end of one completed year of their service at PERA. The gratuity at the time of termination of service shall be given to the employee along with his/her final settlement cheque after clearance from all relevant directorate/Departments in accordance with the prescribed exit procedure. An employee who terminates his/her employment or whose employment is terminated by the Authority, for any reason other than misconduct, shall be entitled to gratuity for every completed year of employment or any part thereof in excess of six months. However, payment of gratuity is subject to availability of budget under relevant head.",
      "score": 0.5453342199325562,
      "page_start": 460,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": false
    },
    {
      "text": "Organizational Structure Director General /BS-19/20 (1) Dir. Finance BS-19 (08) Dir. Admin. & HR BS-19 (17) Dir. Personnel BS-19 (08) Chief Technology Officer SPPP-1 (15) Executive Assistant (PA) /BS-16 (1) Dir. Monitoring & Implement. BS-19 (11) Audit Officer BS-17 (02) Head Count\n\n• Total - 75\n\nHead Legal & Prosecution SPPP-2 (4) CPS for PERA HQs Chief Training Officer SPPP-1 (8)",
      "score": 0.5403326749801636,
      "page_start": 157,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": false
    },
    {
      "text": "6.4 Honoraria PERA may grant honoraria to employees as a form of recognition or reward for exceptional performance, significant achievements, or on special occasions. These are discretionary rewards, not guaranteed entitlements. Employees will be awarded honorarium as per Punjab Enforcement & Regulatory Authority (Performance Appraisal) Regulations, 2025. | 6.5 Payroll Deductions Certain amounts may be deducted from an employee’s salary either due to legal requirements, employee enrollments in benefit programs, or specific situations like penalties or adjustments. PERA’s payroll system will ensure all deductions are transparent and appropriately authorized. The typical deductions that may appear on an employee’s payslip include: • Income Tax: Salaries are subject to withholding of income tax under the law. PERA, as an employer, will deduct income tax at source from monthly salaries in accordance with prevailing tax rates/slabs notified by the Federal Board of Revenue (FBR). The tax deduction is computed on the basis of the employee’s projected annual taxable income (salary plus any honoraria etc.) considering applicable exemptions or relief (like taxable income threshold). | • Provident Fund / Benevolent Fund: For regular and contractual employees, monthly deductions shall be made from their salary as determined by the Authority. These contributions will be credited to the employee’s provident fund or relevant account and payable upon retirement/separation as per applicable rules. The Directorate General retains full discretion to modify deduction rates, contribution structures, or eligibility criteria in accordance with organizational needs and regulatory frameworks. Voluntary additional contributions (if permitted) shall also be governed by the Authority’s prevailing policies. • Absent or Unpaid Leave Deductions: If an employee had any days of leave without pay or was absent without pay in a month, the proportional salary for those days will be deducted. Decision regarding deduction of salary will be taken by Director General at Directorate level and SDEO at Enforcement Station.",
      "score": 0.5303735733032227,
      "page_start": 461,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": false
    },
    {
      "text": "Special Pay Package PERA (SPPP) Breakup Sr. No. Special Pay Package PERA (SPPP) Govt Equivalent Basic Pay Scale PERA Special Allowance Social Security Allowance In lieu of Pension @ 30% *Vehicle Monetization Allowance **Driver\nAllowance | Minimum Pay\n***Market Adjustment Allowance (Negotiable) Maximum Pay Fuel Limit (Petrol Liters)\n\n1 SPPP-1 133,140 | 100,000 | 39,942 | 40,000 | 37,000 | 350,082 | 650,000 | 1,000,082 | 300\n\n2 SPPP-2 99,480 | 90,000 | 29,844 | 40,000 | 37,000 | 296,324 | 450,000 | 746,324 | 250\n\n3 SPPP-3 79,270 | 80,000 | 23,781 | 37,000 | 30,000 | 250,051 | 250,000 | 500,051 | 200\n\n4 SPPP-4 61,970 | 30,000 | 18,591 | 5,000 | 115,561 | 135,000 | 250,561 | 150\n\n5 SPPP-5 48,630 | 25,000 | 14,589 | 2,000 | 90,219 | 110,000 | 200,219 | 100\n\n6 Interns As decided by the Contractual Employment Committee, as per qualification and requirements of the internship. * Vehicle Monetization Allowance also includes vehicle maintenance. ** Driver Allowance shall be reimbursed separately. *** Market Adjustment Allowance means adjustment based on the qualification, experience and competence of the contractual employee\nrecommended by the Contractual Employment Committee and approved by the Director General (PERA) | and may be reviewed upon the\nrecommendations of the Committee. **** Annual increment is based on the notified inflation plus performance incentive based on evaluation, as approved by the Director General (PERA).",
      "score": 0.527425229549408,
      "page_start": 401,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": false
    },
    {
      "text": "THE PUNJAB ENFORCEMENT AND REGULATORY AUTHORITY (APPOINTMENT AND CONDITIONS OF SERVICE FOR CONTRACTUAL EMPLOYEES) REGULATIONS, 2025 CONTENTS\n\n1. Short title and Commencement\n2. Definitions\n3. Terms of Reference of Service for Contractual Employees\n4. Contractual Employment Committee\n5. Duration and Renewal of Contract\n6. Resignation\n7. Termination of Service\n8. Guidelines for Fixing Terms and Conditions of Service for Contract Employment\n9. Repeal\n10. Savings\n\nSCHEDULES (i) Schedule-I - Organizational Structure (ii) Schedule-II - Terms of Reference for Service (iii) Schedule-III - Special Pay Package PERA (SPPP)",
      "score": 0.5182481408119202,
      "page_start": 327,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": false
    },
    {
      "text": "Sr. No. Special Pay Package PERA (SPPP) Govt Equivalent Basic Pay Scale PERA Special Allowance Social Security Allowance In lieu of Pension @ 30% *Vehicle Monetization Allowance **Driver Allowance Minimum Pay ***Market Adjustment Allowance (Negotiable) Maximum Pay Fuel Limit (Petrol Liters) 1 SPPP-1 133,140 100,000 39,942 40,000 37,000 350,082 650,000 1,000,082 300 2 SPPP-2 99,480 90,000 29,844 40,000 37,000 296,324 450,000 746,324 250 3 SPPP-3 79,270 80,000 23,781 37,000 30,000 250,051 250,000 500,051 200 4 SPPP-4 61,970 30,000 18,591 5,000 115,561 135,000 250,561 150 5 SPPP-5 48,630 25,000 14,589 2,000 90,219 110,000 200,219 100 6 Interns As decided by the Contractual Employment Committee, as per qualification and requirements of the internship. CONTRACTUAL EMPLOYEES – SPPP BREAK UP",
      "score": 0.518133282661438,
      "page_start": 156,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": false
    },
    {
      "text": "Appointment shall be made by the Director General on the recommendation of the Contractual Employment Committee. Salary and Benefits:\nSPPP-3 + any other benefit admissible to SPPP-3 as mentioned in Schedule-III.",
      "score": 0.5152081251144409,
      "page_start": 348,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": false
    },
    {
      "text": "Tracker Installation & Insurance For Vehicles Agenda 09",
      "score": 0.513418436050415,
      "page_start": 137,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": false
    },
    {
      "text": "• Professional Tax / Other Government Deductions: Professional Tax will be deducted once a year (usually July or September) by the Authority and deposited to the Excise/Tax authority. • Adjustments and Errors: If any overpayment was made in earlier salary (due to error or any other reason), the overpaid amount will be deducted in the subsequent salary with an explanation. • Documentation: Every deduction will be clearly itemized on the payslip by the Finance Wing. Employees can query Finance Wing if any deduction is not understood. Payroll is reviewed each cycle to ensure deductions are legitimate and correct. PERA ensures compliance with law in all withholdings and strives to not burden employees with undue deductions beyond what is necessary or authorized. Net take-home pay is credited to the employee’s account after all these deductions each month. 6.6 Salary Advances and Employee Loans PERA may formulate detailed policy for longer-term employee loans such as for purchasing a vehicle, house building, or other defined purposes, similar to government departments. For this purpose, a separate policy will be issued by the Authority. • GP Fund Advances/Withdrawals: Employees who contribute to the General Provident Fund are allowed as per Government rules to take advances from their GP Fund balance for various purposes (illness, marriage, education, etc.) and their recovery will be made as per policy / rules of Govt. of Punjab. 6.7 Travel Allowance and Daily Allowance (TA/DA) All employees of PERA who travel on official duty or training are entitled to reimbursement of travel expenses and daily allowances as per Government of Punjab’s policy / rules. The purpose is to cover costs incurred during official travel so that employees are not out-of-pocket for doing their job. All employees, including contractual, will be entitled to TA / DA relevant to their basic scale.",
      "score": 0.5120444893836975,
      "page_start": 462,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": false
    },
    {
      "text": "Schedule-III Special Pay Package PERA (SPPP) Summary Sr. No. Special Pay Package PERA (SPPP) Minimum Pay per Month (PKR) Maximum Pay per Month (PKR) Fuel Limit (Petrol Liters/Month)\n\n1 SPPP-1* | 350,082 | 1,000,082 | 300\n\n2 SPPP-2* | 296,324 | 746,324 | 250\n\n3 SPPP-3* | 250,051 | 500,051 | 200\n\n4 SPPP-4 | 115,561 | 250,561 | 150\n\n5 SPPP-5 | 90,219 | 200,219 | 100\n\n6 Interns As decided by the Contractual Employment Committee, as per qualification and requirements of the internship. *Special PERA pay package of SPPP-1, SPPP-2 & SPPP-3 shall be approved as per decision of the Authority.",
      "score": 0.5110756754875183,
      "page_start": 400,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": false
    },
    {
      "text": "Position Title: - Android Developer\nReport To: - | Manager Development\nWing: - | IT & Communication\nPurpose of the Position:\nThe Android Developer designs, develops, and maintains high-performance Android applications. This role involves working with Kotlin/Java, modern Android frameworks, and best practices to create scalable, secure, and user-friendly mobile apps. Areas of Responsibilities:\n Experience in Design, Illustrator, Dreamweaver, Photoshop, Figma, Adobe XD etc. Should be well versed in HTML, CSS, Bootstrap and jQuery.  Conduct usability for android apps, testing to gather feedback and make improvements to designs.  Ability to be able to form, prototype and confidently present ideas.  Design and build native Android applications using Kotlin (preferred) or Java.  Implement Jetpack components (ViewModel, LiveData, Room, Compose).  Ensure responsive UI/UX with Material Design guidelines.  Optimize apps for performance, battery efficiency, and memory usage.  Connect Android apps to RESTful APIs (Retrofit, OkHttp).  Handle authentication (OAuth, JWT, Firebase Auth).  Work with real-time data (WebSockets, Firebase Realtime DB).  Write unit tests & UI tests (JUnit, Espresso, Mockito).  Debug and fix crashes using Android Studio, Logcat, and Firebase Crashlytics.  Conduct performance profiling (Android Profiler, Systrace).  Keep apps updated with the latest Android SDK & security patches.  Reduce APK size and improve load times.  Support different screen sizes, OS versions, and devices.  Work with cross-functional teams (Backend, UX/UI, QA).  Follow Agile/Scrum methodologies (sprints, code reviews).  Stay updated with Android trends (Jetpack updates, new APIs). Qualification and Experience:\ni Bachelor’s degree (Hons) in IT, Computer Sciences or Software Engineering or any | other\nrelevant / | similar degree from a recognized university; and\nii 3 years’ post qualification experience in the relevant field including at least one years’ experience in public sector. Note: Experience in private entities shall be accepted if such entity is registered with SECP, Registrar of Firms or any other Public Sector Regulatory Authority. Competencies & Personal Attributes:\n A hands-on management approach that encourages change and creative problem-solving.  Ability to manage and maintain the operation of the data center and IT Networks.  Ability to work well in a fast-paced and high-intensity environment.  Strong relationship-building skills.  Good knowledge of market trends of Technology. Appointment:\nAppointment shall be made by Director General on the recommendation s of the Contractual Employment Committee. Salary and Benefits:\nSPPP-4 + any other benefit admissible to SPPP-4 as mentioned in Schedule-III",
      "score": 0.5091059803962708,
      "page_start": 355,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": false
    },
    {
      "text": " Strong Knowledge of Contract Management Appointment:\nAppointment shall be made by the Director General on the recommendation of Contractual Employment Committee. Salary and Benefits:\nSPPP-3 + any other benefit admissible to SPPP-3 as mentioned in Schedule-III.",
      "score": 0.5082651376724243,
      "page_start": 350,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": false
    },
    {
      "text": "Position Title: - Assistant Manager (Network)\nReport To: - | Manager (Infrastructure & Networks)\nWing: - | IT & Communication\nPurpose of the Position:\nResponsible for maximizing the performance of IT Networks and provide, training, and development of the workforce; process and procedure development to achieve operational excellence. Areas of Responsibilities:\n To assist to perform various IT Network Administration tasks including the following areas of responsibility:\n Data Centre Management  Core Network Infrastructure  Firewalls, Routers and Switches  Implement policies and procedures to meet service expectatio ns and quality for Operations through Firewall/Domain Controller.  Monitor network performance and optimize the network for optimal speed and availability.  Servers Management and their uptime assurance.  Deploy, configure, and update Domain Controller Group Policies.  Deploy, configure, and upgrade network software’s, such as enterprise antivirus or other remote support programs.  Installation of all types of updates like Windows 11, Windows Server 2016/2019/2022, Antivirus and Office 365 & MS Exchange Management.  Server and Network Equipment Management.  Responsible for Implementation of Policies, Procedures and SOPs.  Provide a high level of Technical Support to all Users.  Respond to Trouble tickets raised by Help Desk and is responsible for the resolution.  All IT Infra & systems administration functions like User Access control, Patch management, Virus Management, Spam Management, etc. Qualification and Experience:\ni Bachelor’s degree (Hons) in IT, Computer Sciences , Telecommunication or Software\nEngineering or any other relevant / | similar degree from a recognized university; and\nii 3 years’ post qualification experience in the relevant field including at least two years’ experience in public sector. Note: Experience in private entities shall be accepted if such entity is registered with SECP, Registrar of Firms or any other Public Sector Regulatory Authority. Competencies & Personal Attributes:\n A hands-on management approach that encourages change and creative problem-solving.  Ability to manage and maintain the operation of the data center and IT Networks.  Ability to work well in a fast-paced and high-intensity environment.  Strong relationship-building skills.  Good knowledge of market trends of Technology. Appointment:\nAppointment shall be made by Director General on the recommendation of Contractual Employment Committee. Salary and Benefits:\nSPPP-5 + any other benefit admissible to SPPP-5 as mentioned in Schedule-III",
      "score": 0.5048587918281555,
      "page_start": 352,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": false
    },
    {
      "text": "Chapter VII: Contract Renewal, Termination and Resignation of Contractual Employees 7.1 Contract Renewal 7.1.1 Minimum Tenure Requirement | All contractual appointments at PERA shall be made for a minimum period of three (3) years or more, subject to the needs of the Authority. The duration shall be determined by the Director General based on recommendations from Contractual Employment Committee-I, ensuring alignment with strategic workforce planning. 7.1.2 Performance-Based Evaluation | Renewal of a contractual employee shall be strictly contingent on demonstrated satisfactory performance, professional conduct, and compliance with PERA’s strategic goals. The performance of a contractual will be assessed in the light of PERA Performance Appraisal Regulations, 2025. HR shall initiate a comprehensive evaluation at least one (1) month prior to the contract's expiry, including input from the supervisor, performance appraisals, and disciplinary records. | 7.1.3 Renewal Approval Process The concerned Director shall forward a formal recommendation for renewal to Director Admin along with supporting performance documentation. HR / Admin Wing shall compile the case and submit it to the Director General for approval. The renewal or extension of contracts for contractual employees at Enforcement Stations shall be subject to the recommendation of the Chairperson of the District Board. Upon approval, HR shall issue a formal renewal letter specifying the new contract duration and any revised terms and conditions. 7.1.4 Advance Renewal Notification To ensure employee clarity and operational continuity, PERA shall endeavor to issue written communication at least one (1) month prior to contract expiry, stating whether the contract is: (a) recommended for renewal, (b) not recommended for renewal, or (c) under review due to pending external or internal decisions.",
      "score": 0.5041548013687134,
      "page_start": 463,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": false
    },
    {
      "text": "Position Title: - Web & Software Developer\nReport To: - | Manager (Development)\nWing: - | IT & Communication\nPurpose of the Position:\nHe shall design, develop, and maintain web and software applications to meet business and user requirements. This role involves working across front -end, back -end, and full -stack development, ensuring high performance, security, and scalability. Areas of Responsibilities:\n Experience in Design, Illustrator, Dreamweaver, Photoshop, Figma, Adobe XD etc. Should be well versed in HTML, CSS, Bootstrap and jQuery.  Conduct user research and develop business requirement document to understand user needs and preferences. Use this data to inform design decisions.\n Develop and maintain the information architecture of digital products to ensure | logical and\nuser-friendly navigation.  Ensure designs are responsive and accessible across various devices and platforms.  Ability to be able to form, prototype and confidently present ideas.  Work with UI/UX designers, product managers, and QA teams.  Participate in Agile/Scrum processes (sprints, stand-ups, retrospectives).  Stay updated with emerging technologies and industry trends.  Work with CI/CD pipelines (GitHub Actions, Jenkins, GitLab CI/CD).  Deploy applications on cloud platforms (AWS, Azure, GCP).  Use containerization (Docker, Kubernetes) for scalable deployments.  Perform unit, integration, and end-to-end testing (Jest, Selenium, Cypress).  Design and manage databases (SQL: PostgreSQL, MySQL; NoSQL: MongoDB, Firebase).  Optimize queries and ensure data security and integrity.  Implement authentication and authorization (OAuth, JWT, SSO).  Design, develop, and maintain responsive web applications using modern frameworks (React, Angular, Vue.js).  Build and optimize server-side applications (Node.js, Python, Java, .NET, PHP).  Develop RESTful APIs and integrate third-party services.  Ensure cross-browser compatibility, accessibility, and mobile responsiveness. Qualification and Experience:\ni Bachelor’s degree (Hons) in IT, Computer Sciences , or Software Engineering or any other\nrelevant / | similar degree from a recognized university; and\nii 3 years’ post qualification experience in the relevant field including at least one years’ experience in public sector. Note: Experience in private entities shall be accepted if such entity is registered with SECP, Registrar of Firms or any other Public Sector Regulatory Authority. Competencies & Personal Attributes:\n A hands-on management approach that encourages change and creative problem-solving.  Ability to manage and maintain the operation of the data center and IT Networks.  Ability to work well in a fast-paced and high-intensity environment.  Strong relationship-building skills.  Good knowledge of market trends of Technology. Appointment:\nAppointment shall be made by Director General on the recommendation of Contractual Employment Committee. Salary and Benefits:\nSPPP-4 + any other benefit admissible to SPPP-4 as mentioned in Schedule-III",
      "score": 0.5034840106964111,
      "page_start": 354,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": false
    },
    {
      "text": "Position Title: - Assistant Manager (IT Infrastructure)\nReport To: - | Manager (Infrastructure & Networks)\nWing: - | IT & Communication\nPurpose of the Position:\nResponsible for maximizing the performance of IT Networks and provide, training, and development of the workforce; Process and procedure development to achieve operational excellence. Areas of Responsibilities:\n To assist to perform various IT Network Administration tasks including the following areas of responsibility:\n Data Centre Management  Core Network Infrastructure  Firewalls, Routers and Switches  To implement policies and procedures to meet service expectations and quality for Operations through Firewall/Domain Controller.  To Monitor network performance and optimize the network for optimal speed and availability.  Deploy, configure, and upgrade network software, such as enterprise antivirus or other remote support programs.  Installation of all types of updates like Windows 11, Windows Server 2016/2019/2022, Antivirus and Office 365 & MS Exchange Management.  Provide a high level of Technical Support to all Users.  Respond to Trouble tickets raised by Help Desk and is responsible for the resolution.  All IT network & systems administration functions like User Access control, Patch management, Virus Management, Spam Management, etc. Qualification and Experience:\ni Bachelor’s degree (Hons) in IT, Computer Sciences , Telecommunication | or Software\nEngineering or any other relevant / | similar degree from a recognized university; and\nii 2 years’ post qualification experience in the relevant field including at least one years’ experience in public sector. Note: Experience in private entities shall be accepted if such entity is registered with SECP, Registrar of Firms or any other Public Sector Regulatory Authority. Competencies & Personal Attributes:\n A hands-on management approach that encourages change and creative problem-solving.  Ability to manage and maintain the operation of the data center and IT Networks.  Ability to work well in a fast-paced and high-intensity environment.  Strong relationship-building skills.  Good knowledge of market trends of Technology. Appointment:\nAppointment shall be made by Director General on the recommendation of Contractual Employment Committee Salary and Benefits:\nSPPP-5 + any other benefit admissible to SPPP-5 as mentioned in Schedule-III",
      "score": 0.5022604465484619,
      "page_start": 353,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": false
    },
    {
      "text": "Position Title: - Manager Monitoring\nReport To: - | Head Monitoring (MIS & GIS)\nWing: - | Monitoring & Implementation\nPurpose of the Position:\nThe Manager Monitoring is responsible for assisting in the planning, execution, and management of monitoring activities. The role focuses on ensuring effective tracking of performance indicators, data validation, field monitoring, reporting, and supporting evidence-based decision-making. Areas of Responsibilities:\n Develop and implement monitoring frameworks to track depa rtmental KPIs, targets, and compliance.  Regularly assess processes, systems, and workflows to identify inefficiencies or deviations.  Ensure data accuracy by validating reports and dashboards.  Track project performance indicators, targets, and results as per defined log frames or KPIs  Support data collection, verification, and analysis to ensure accuracy and reliability.  Prepare periodic monitoring reports (monthly, quarterly, annual) with observations and recommendations  Generate regular and ad-hoc reports for internal and external stakeholders  Preparing final analysis reports for the stakeholders to understand the data analysis steps, enabling them to take important decisions based on various facts and trends. Reports and presentations as per requirements from time to time.  Collect, process, and analyze spatial data to support task planning, monitoring, and evaluation  Collaborate with IT teams to ensure the smooth functioning of MIS and GIS systems  Develop standardized Excel and Presentation templates for recurring monitoring needs  Ensure timely and quality data entry into project monitoring systems or dashboards  Generate analytical reports, summaries, and presentations for internal and external stakeholders  Highlight potential risks, delays, or deviations through monitoring findings  Liaise with relevant departments for the timely resolution of issues identified during monitoring  Support planning and coordination of review meetings and performance evaluations  Provide training and orientation on M&E tools and reporting formats to field staff or partners  Build capacity of teams in monitoring practices, indicator tracking, and results-based reporting  Ensure compliance with organizational policies, and government regulations  Recommend improvements in program design or delivery based on monitoring insights  Ensure documentation and archiving of monitoring data, reports, and evidence  Preparing reports for the management stating trends, patterns, and predictions using relevant data  Assess the effectiveness and accuracy of new data sources and data gathering techniques Qualification and Experience:\niv Bachelor’s degree (Hons) in IT, Computer Sciences, GIS, | Social, Administrative or\nManagement Sciences any or any relevant / similar degree from a recognized university; and v Minimum of 05 years of experience in experience in Monitoring & Evaluation, management, administration, operations, or a similar role. preferably in government, or development projects. vi Note: Experience in private entities shall be accepted if such entit y is registered with SECP, Registrar of Firms or any other Regulatory Authority. Competencies & Personal Attributes:\n Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint).  Strong leadership, team building and problem-solving abilities  Excellent communication, coordination, and interpersonal skills.  Analytical mindset with problem-solving abilities.  Experience with project cycle management and M&E tools.  Understanding of logical frameworks, KPIs, and performance monitoring processes.",
      "score": 0.498102068901062,
      "page_start": 386,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": false
    },
    {
      "text": "Position Title: - Assistant Manager IT & LMS\nReport To: - | Senior Manager Academics\nWing: - Training Purpose of the Position:\nThe Assistant Manager IT & LMS is responsible for managing the digital infrastructure and e-learning ecosystem of PERA’s training station . This includes overseeing the deployment, maintenance, and\noptimization of Learning | Management Systems (LMS), managing digital classrooms, ensuring\ncybersecurity, and supporting both faculty and trainees with IT-enabled academic tools Areas of Responsibilities:\n Configure, maintain, and update the LMS platform (e.g., Moodle, Google Classroom, or a custom solution).  Upload course content, manage user accounts (faculty and trainees), and ensure proper access control and data backups.  Monitor LMS performance, troubleshoot issues, and coordinate with technical support or vendors.  Assist academic staff in digitizing content, creating interactive training modules, and uploading courseware (videos, quizzes, case studies).  Provide technical support for online classes, webinars, and virtual workshops.  Facilitate blended learning models and remote learning capabilities for off-site law enforcement officers.  Manage and maintain academic IT equipment including servers, projectors, smart boards, network devices, and biometric attendance systems.  Coordinate setup for computer-based testing (CBT), virtual simulations, and assessment tools.  Ensure data protection, system integrity, and compliance with institutional IT policies.  Train faculty and staff in the effective use of LMS and digital tools.  Develop user manuals and conduct orientation sessions for new trainees and instructors.  Provide real-time troubleshooting and helpdesk services for academic IT-related issues.  Generate usage statistics, assessment reports, and engagement metrics from the LMS.  Support the academic evaluation process by exporting performance data and dashboards.  Recommend improvements in learning technologies based on feedback and analytics. Qualification and Experience:\ni 16 years’ education in Preferably in Computer Science/ Information Technology/ Software Engineering or any other discipline(s) i.e. Administrative, Management or Social Sciences with adequate Computer Knowledge. ii 2 years of management services experience in a reputable organization(s) and having more than 1 year experience in public sector organization. Note: Experience in private entities shall be accepted if such entity is registered with SECP, Registrar of Firms or any other Public Sector Regulatory Authority. Competencies & Personal Attributes:\n Good software diagnostics skills required  Excellent written and verbal communication skills.  Communication Skills.  Analytical skills.  Must be proficient in the use of IT and MS office  Possess noting/drafting skills Appointment:\nAppointment shall be made by Director General on the recommendation s of the C ontractual Employment Committee. Salary and Benefits:\nSPPP-5 + any other benefit admissible to SPPP-5 as mentioned in Schedule-III",
      "score": 0.14,
      "page_start": 399,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": true
    },
    {
      "text": "Position Title: - Assistant Manager Admin & Logistics\nReport To: - | Senior Manager Training & Admin\nWing: - Training Purpose of the Position:\nThe Assistant Manager Admin & Logistics is responsible in ensuring the smooth operation of training programs by managing administrative processes, facility logistics, and resource allocation. The officer is responsible for coordinating accommodation, transportation, supplies, a nd record -keeping necessary for conducting effective training of PERA personnel. Areas of Responsibilities:\n Maintain personnel records of trainees, instructors, and visiting faculty.  Prepare official correspondence, reports, memos, and documentation related to training events.  Facilitate onboarding, registration, and attendance tracking of training participants.  Coordinate meetings, workshops, and briefings for training staff and external partners.  Arrange logistics for training sessions, including venue setup, transport, audio-visual aids, and security coordination.  Manage inventory including availability of training materials, uniforms, stationary, and field equipment.  Oversee facility readiness, including classrooms, simulation rooms, barracks, mess halls, and parade grounds.  Track usage and condition of training-related assets (vehicles, furniture, tools, ICT equipment).  Initiate procurement requests for logistics and training supplies in coordination with procurement and finance teams.  Maintain updated logs for issued items and ensure proper storage and maintenance.  Liaise with internal departments (e.g., HR, Finance, Security) and external vendors to fulfill operational needs.  Ensure compliance with administrative and logistical protocols established by the agency.  Support emergency response readiness for health, safety, and critical incidents during training programs.  Compile daily, weekly, and monthly reports on logistics, maintenance, and trainee needs.  Maintain audit-ready records of procurement, material issuance, and administrative actions.  Document post-training evaluations and logistical feedback to improve future planning.  Management of POL of Official Vehicles and Officials. Qualification and Experience:\ni BS/BSc/Master’s degree in Business Administration, Management Sciences, Logistics, Supply Chain Management or equivalent (16 years’ education) from an HEC recognized University; and ii 2 years’ post qualification experience in relevant field including at least one-year experience in public sector. Competencies & Personal Attributes:\n Training & Instructional Expertise.  Operational & Tactical Knowledge.  Crisis & Adaptive Decision-Making  Communication & Interpersonal Skills. Appointment:\nAppointment shall be made by Director General on the recommendations of the Contractual Employment Committee. Salary and Benefits:\nSPPP-5 + any other benefit admissible to SPPP-5 as mentioned in Schedule-III",
      "score": 0.14,
      "page_start": 398,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": true
    },
    {
      "text": "GOVERNMENT OF THE PUNJAB PUNJAB ENFORCEMENT AND REGULATORY AUTHORITY\nLahore, Dated the May | , 2025\nN O T I F I C A T I O N THE PUNJAB ENFORCEMENT AND REGULATORY AUTHORITY (EFFICIENCY & DISCIPLINE) REGULATIONS, 2025 No.xxxxxxx (Director Admin).- In exercise of the powers conferred under section 79 read with\nsec 11 | (2), of the Punjab Enforcement and Regulation Act 2024 and rule 3 of the Punjab\nEnforcement and Regulatory Authority Rules, 2024, the Authority is pleased to make the following Regulations:\n\n1. Short title and Commencement . - (1) These Regulations may be cited as the Punjab\n\nEnforcement and Regulatory Authority (Efficiency & Discipline) Regulations, 2025.\n(2) | These Regulations shall come into force at once.\n\n2. Definitions. - (1) In the Regulations, unless the context othe rwise requires, the following\n\nexpressions shall have the meanings hereby respectively assigned to them, that is to say:\n\na. “Accused” means a PERA employee against whom disciplinary action is initiated.\nb. “Appellate Authority” means the authority designated to hear and decide appeals against\n\npenalties imposed under these regulations as per Schedule-I.\n\nc. “Competent Authority” refers to the authority designated to impose penalties under these\n\nregulations as per Schedule-I.\n\nd. “Corruption” means as defined the Punjab Employees Efficiency, Discipline and\n\nAccountability Act 2006 and as amended from time to time.\n\ne. “Departmental Inquiry” refers to a formal process involving the framing of charges, written\n\ndefense, examination of evidence, and su bmission of findings by an appointed Inquiry Officer or Inquiry Committee.\n\nf. “Inefficiency” means as defined the Punjab Employees Efficiency, Discipline and\n\nAccountability Act 2006 and as amended from time to time.",
      "score": 0.14,
      "page_start": 403,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": true
    },
    {
      "text": "g. “Misconduct” means as defined the Punjab E mployees Efficiency, Discipline and\n\nAccountability Act 2006 and as amended from time to time.\n\nh. “Summary Inquiry” refers to a swift, informal inquiry conducted for minor offences where\n\nimmediate action is deemed appropriate.\n\n3. Grounds for Proceedings - An employee shall be liable to be proceeded against under th ese\n\nRegulations, if he is–\n\ni. inefficient or has ceased to be efficient for any reason; or\n\nii. guilty of misconduct; or iii. guilty of corruption or is reasonably considered to be corrupt because-\n\na. he is or any of his dependents or any other person through him or on his behalf is,\n\nin possession (for which he can not reasonably account) of pecuniary resources of property disproportionate to his known sources of income; or\n\nb. he has assumed a style of living beyond his ostensible means; or\n\niv. engaged or is reasonably believed to be engaged in subversive activities, and his retention in service is prejudicial to national security, or is guilty of disclosure of official secrets to any unauthorized person.\n\n4. Penalties – (1) The competent authority may, by an order in writing, impose one or more of the\n\nfollowing penalties, namely:- (a) Minor penalties– (i) censure; (ii) confinement of sergeants and senior sergeants for 15 days to Quarter Guards;\n(iii) | withholding of increment or increments, for a specific period, subject to a maximum\nof five years;\n(iv) | fine not exceeding basic pay of one month;\n(v) | reduction to a lower stage or stages in pay scale, subject to a maximum of five stages;\nand\n(vi) | withholding of promotion for a specific period, subject to a maximum of five years;\nprovided that this period shall be counted from the date when a person junior to the accused is considered for promotion and is promoted on regular basis for the first time;",
      "score": 0.14,
      "page_start": 404,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": true
    },
    {
      "text": "(b) Major penalties–\n(i) | recovery from pay, pension or any other amount payable to the accused, the whole\nor a part of any pecuniary loss caused to the Government or the organization in w hich he was employed, and if the amount due from any such person cannot be wholly recovered from the pay, pension or any other amount payable to him, such amount shall be recovered under the law for the time being in force;\n(ii) | reduction to a lower post and pay scale from the substantive or regular post for a\nspecific period subject to a maximum of five years;\n(iii) | forfeiture of past service for a specific period subject to a maximum of five years;\n(iv) | compulsory retirement;\n(v) | removal from service; and\n(vi) | dismissal from service; and\n(c) | Penalties after retirement–\n\n(i) | withholding of pension or any part thereof | for a specific period keeping in view the\n\nloss caused to the Government];\n(ii) | withdrawing of pension or any part thereof for a specific period keeping in view the\nloss caused to Government; and\n(iii) | recovery from pension or any other amount payable to the accused, of pecuniary loss\ncaused to the Government or the organization in which he was employed, and if the amount due from any such person cannot be wholly recovered from the pension or any other amount payable to him, such amount shall be recovered under the law for the time being in force.\n\n(2) | Dismissal from service under th ese Regulations | shall disqualify the employee for future\n\nemployment under the Government or under any organization to which the provisions of these Regulations apply.\n(3) | Any penalty under these Regulations shall not absolve an employee or accused from liability\nto any punishment to which he may be liable for an offence, under any law, committed by him while in service. Provided that in case of retired employee, the proceedings so initiated against a retired employee shall be finalized not later than two years of his retirement.\n\n5. Suspension.– An employee against whom action is proposed to be initiated under these\n\nRegulations may be placed under suspension for a period of 120 days, if in t he opinion of the competent authority, suspension is necessary or expedient, and if the period of suspension is not",
      "score": 0.14,
      "page_start": 405,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": true
    },
    {
      "text": "Approval For Initiation Of Land Acquisition Proceedings For PERA Enforcement Station At Hassanabdal, District Attock & Kot Chutta, District DG Khan (Agenda 16 – Flag T) No state land for ES in Hassanabdal and Kot Chutta, District DG Khan as per DCs DG PERA may be authorized to initiate case for acquisition of land for ES Hassanabdal, District Attock and Kot Chutta, District DG Khan",
      "score": 0.14,
      "page_start": 153,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": true
    },
    {
      "text": "Sr. No. Special Pay Package PERA SPPP Minimum Pay per Month (PKR) Maximum Pay per Month (PKR) Fuel Limit (Petrol Liters/Month) 1 SPPP-1 350,082 1,000,082 300 2 SPPP-2 296,324 746,324 250 3 SPPP-3 250,051 500,051 200 4 SPPP-4 115,561 250,561 150 5 SPPP-5 90,219 200,219 100 6 Interns CONTRACTUAL EMPLOYEES - SPPP",
      "score": 0.14,
      "page_start": 155,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": true
    },
    {
      "text": "Post Description BS / SPPP DG Admin Training Fin. Legal & Pros Pers. Audit Monitoring & Imp. IT & Comm. Total DG BS 20 1 01 Director BS 19 1 1 1 1 04 Deputy Director BS 18 1 1 1 03 Assistant Director BS 17 2 1 2 05 Audit Officer BS 17 1 1 Auditor/Accountant BS 16 1 1 2 Executive Assistant/Assistant (Discipline) BS 16 1 1 2 1 3 2 01 11 Office Assistant BS-14 1 1 Contractual (SPPP) SPPP 11 8 2 3 2 - 07 14 47 Total 02 17 08 08 04 08 02 11 15 75 Summary - Directorate General (Updated)",
      "score": 0.14,
      "page_start": 158,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": true
    },
    {
      "text": "Head Count\n\n• BS 19 - 01\n• BS 18 - 01\n• BS 17 - 02\n• BS 16 - 01\n• BS 14 - 01\n\n• SPPP - 11\n\nTotal - 17 Director Admin & HR /BS-19 (1) AD Admin & HR /BS-17 (1) DD Admin & HR /BS-18 (1) Dy Manager HR / SPPP-4 (1) Head Proc.& Contracting / SPPP-2 (1) Assistant Manager HR / SPPP-5 (2) Executive Assistant (PA) /BS-16 (1) Office Assistant /BS14 (1) Administration Assistant Manager Proc. / SPPP-5 (2) AD Logistics & Inventory /BS-17 (1) Dy Manager Inventory & WH / SPPP- 4 (1) Assistant Manager Admin / SPPP5 (1) Assistant Manager Protocol /SPPP5 (1) Assistant Manager Logistics / SPPP-5 (1) Assistant Manager Store /SPPP-5 (1)",
      "score": 0.14,
      "page_start": 159,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": true
    },
    {
      "text": "Director Finance /BS-19 (1) AD Finance (Budget) /BS-17 (1) DD Finance /BS-18 (1) Assistant Manager Finance /SPPP-5 (2) Accountant /BS-16 (1) Executive Assistant (PA) /BS-16 (1) Executive Assistant (PA) /BS-16 (1) Finance Head Count\n\n• BS 19 - 01\n• BS 18 - 01\n• BS 17 - 01\n• BS 16 - 03\n\n• SPPP - 02\n\nTotal - 08",
      "score": 0.14,
      "page_start": 160,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": true
    },
    {
      "text": "5.2.2 Annual Leave (Earned Leave) Annual leave is granted to support employees’ rest, recuperation, and personal commitments. Contractual employees are entitled to Two (2) days earned leave(s) per month, in addition to casual leave. Following will be conditions for earned leave; a) Shall accrue from the date of joining; | b) Shall be on full salary; c) Shall not be carried over to the next calendar year; d) Leave encashment shall not be admissible in lieu of earned leave(s); e) Shall be subject to formal sanction of the immediate supervisor, f) Unauthorized leave shall be treated as absence from duty and no leave salary shall be admissible; 5.2.3 Medical Leave In special circumstances of serious illness or a serious accident due to which an employee is incapable of performing duty beyond a period of 10 days, he/she shall be entitled to medical leave which; a) Shall be on full salary: b) Shall not exceed 60 days at a stretch: beyond that an employee will be on leave without pay; c) Shall be admissible on production of medical certificate of such illness or accident issued by an authorized medical officer of a Government hospital; | After prolonged or contagious illness, HR may require a fitness certificate before return to duty. For maternity-related complications, sick leave may supplement maternity leave with medical proof. Frequent or suspicious sick leave patterns may trigger medical verification. | 5.2.4 Maternity / Paternity Leave a) Maternity leave may be granted on full pay, outside the leave account, to a female contractual employee to the extent of ninety days. Such leave may not be granted for more than two times during the whole employment.",
      "score": 0.14,
      "page_start": 457,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": true
    },
    {
      "text": "b) Paternity leave may be granted on full pay, outside the leave account, to a male contractual employee up to maximum of seven days. Such leave may not be granted for more than two times during the whole employment. 5.3 Unauthorized Absence Any absence without prior approval is considered unauthorized and results in salary deduction and possible disciplinary action. Absences of 5 or more consecutive working days without notice may trigger formal proceedings. Repeated partial absences or skipping work hours are also subject to action. In cases of genuine emergencies where communication was impossible (e.g., hospitalization), employees may request retrospective regularization. Unauthorized leave is recorded in HR systems and negatively affects performance appraisals.",
      "score": 0.14,
      "page_start": 458,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": true
    },
    {
      "text": "Chapter VI: Salary and Benefits 6.1 Salary Structure and Pay Scales PERA’s salary structure is aligned with government-approved pay scales and any special pay packages approved by the Authority. The categories of employees and their salary determination are as follows: • Regular Employees (Permanent Staff): PERA’s regular employees are typically governed by the Basic Pay Scales (BPS) system. These employees will be entitled to such PERA Special Pay Package as per service regulations. | • Deputationists: Deputationists who join PERA will draw the salary and allowances as admissible to them as per Deputation Policy of Govt. of Punjab. | • Contractual Employees: Contract employees hired under the Special PERA Pay Package (SPPP) may not be on BPS but on lump-sum contract salaries. These salaries could be structured as all-inclusive (no separate allowances, just one consolidated amount) or with certain breakout (like a base pay plus social security benefits etc.), as stated in the contract. Such employees are not eligible for the standard government allowances that regular BPS employees get. However, PERA ensures that contract pay packages are competitive and commensurate with the qualifications and expertise required. • Pay Days and Mode: Salaries are paid on a monthly basis, typically by the last working day of each month. If that day falls on a weekend or holiday, salaries may be disbursed on the preceding working day. Payment is made via direct bank transfer to the employee’s designated bank account (as per the salary account details provided on joining). | • Salary during Probation Period: Note that employees on probation receive the same salary as confirmed ones in that grade; probation does not imply a lower salary (only difference is lack of job security initially). • Salary during Training: Employees of the Authority during induction training will not be entitled to Special PERA Allowance. | In conclusion, PERA strives to maintain equitable pay practices. Regular employees enjoy the security of government scales and benefits, contract employees receive market-aligned",
      "score": 0.14,
      "page_start": 459,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": true
    },
    {
      "text": "7.1.5 Non-Renewal Procedure In cases where the Authority opts not to renew a contract, a formal Contract Expiry Notice shall be issued. The notice may acknowledge the employee's service and, where appropriate, state a general reason for non-renewal. | 7.1.6 Terms upon Renewal Renewed contracts may either retain existing terms or incorporate modifications such as revised salary, adjusted duties, or updated clauses reflecting policy changes. These shall be explicitly outlined in the renewal letter. Probation clauses shall not be re-applied post-renewal; the employee shall be considered experienced. 7.1.7 Duration of Renewal Contract renewal may be for a period equal to or longer than the original term as decided by the Director General. 7.1.8 Documentation and Recordkeeping Renewal letters must be signed and acknowledged by the employee, and retained in the personal file. Where external approvals are required, the competent authority shall coordinate the process with the relevant departments or governing bodies. 7.2. Termination During Probation 7.2.1 Purpose of Probation Probation is a period of evaluation to determine an employee’s suitability for the assigned role. It allows PERA to assess competence, work ethic, and organizational fit prior to confirmation of appointment. 7.2.2 Grounds for Termination An employee on probation may be terminated on the following grounds: • Persistent underperformance despite support and guidance; • Behavioral or conduct issues including insubordination, habitual tardiness, or unprofessional behavior; • Discovery of fraudulent credentials or material misrepresentation at the time of hiring.",
      "score": 0.14,
      "page_start": 464,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": true
    },
    {
      "text": "Schedule-IV Rules / Regulations Adopted by the Authority\n\n1. PEEDA Act, 2006.\n2. Deputation Policy, 1998.\n3. Punjab Civil Servants (Conduct) Rules, 1966.\n4. Punjab Civil Servants (Pension), Rules, as amended from time to time.\n5. Punjab Revised Leave Rules, 1981.\n6. Punjab Police (E&D), Rules, 1975, as amended from time to time.\n7. Punjab GP Fund Rules, 1978.\n8. Recruitment Policy, 2022, as explained in Section 14 of the Regulations",
      "score": 0.14,
      "page_start": 324,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": true
    },
    {
      "text": "Schedule-V Transfer and Posting of the Employees Sr. No Position Grade Competent Authority 1 Director BS-19 Director General 2 Deputy Director BS-18 Director General 3 Assistant Director BS-17 Director General 4 Executive Assistant BS-16 Director (Admin & HR) 5 Office Assistant BS-14 Director (Admin & HR) 6 SDEO BS-16/17 Director General in consultation with Vice Chairperson of the Authority 7 EO BS-14\n\n• Inter-district - Director General\n• Intra-district - Chairperson Board\n\n(from Enforcement Station to Enforcement Station only). 8 IO BS-11\n\n• Inter-district – Director General\n• Intra-district - Chairperson Board\n\n(from Enforcement Station to Enforcement Station only). 9 Senior Sergeant BS-09\n\n• Inter-district - Director\n\n(Personnel) or Director (Monitoring & Implementation), as the case may be, in consultation with Director General\n\n• Intra-district – Chairperson Board\n\n(from Enforcement Station to Enforcement Station only) 10 Sergeant BS-07\n\n• Inter-district - Director\n\n(Personnel) or Director (Monitoring & Implementation), as the case may be, in consultation with Director General\n\n• Intra-district – Chairperson Board\n\n(from Enforcement Station to Enforcement Station only) Note: Chairperson District Board shall be competent to assign additional charge of any vacant post, except SDEO.",
      "score": 0.14,
      "page_start": 325,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": true
    },
    {
      "text": "Schedule-VI Special Allowance & Benefits Sr. No. BS Pay + Allowance PERA Special Allowance* Deputation Allowance Fuel Limit 1 BS-20 Pay means Basic Pay plus increment as per the length of service, and allowances means all the allowances\nbeing drawn | by the Officer /\nOfficial who has been appointed by transfer or by deputation. 150,000 As per latest notified rate by the Finance Department, in this regard. - 2 BS-19 125,000 350 3 BS-18 100,000 300 4 BS-17 75,000 250 5 BS-16 50,000 200 6 BS-14 40,000 - 7 BS-11 30,000 - 8 BS-09 25,000 - 9 BS-07 20,000 -",
      "score": 0.14,
      "page_start": 326,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": true
    },
    {
      "text": "GOVERNMENT OF THE PUNJAB PUNJAB ENFORCEMENT AND REGULATORY AUTHORITY Lahore, Dated the May, 2025 N O T I F I C A T I O N THE PUNJAB ENFORCEMENT AND REGULATORY AUTHORITY (APPOINTMENT AND CONDITIONS OF SERVICE FOR CONTRACTUAL EMPLOYEES) REGULATIONS, 2025 No.xxxxxxx (Director Admin. & HR).- In exercise of the powers conferred under Section 79 read with Section 11 of the Punjab Enforcement and Regulation Act, 2024 and Rule 3 of the Punjab Enforcement and Regulatory Authority Rules, 2024 , the Authority is pleased to make the following Regulations:\n\n1. Short title and Commencement. - (1) These Regulations may be cited as the Punjab\n\nEnforcement and Regulatory Authority (Appointment and Conditions of Service for Contractual Employees) Regulations, 2025 and shall be published in the official Gazette of Government of the Punjab.\n(2) | These Regulations shall come into force at once.\n\n2. Definitions. - (1) In these Regulations, unless the context otherwise requires, the following\n\nexpressions shall have the meanings hereby respectively assigned to them, that is to say:\n(a) “Act” means the Punjab Enforcement and Regulation Act 2024 (Act XI of 2024); (b) “Administrative Department / AD” means the administrative department of the Authority as reflected in the Punjab Government Rules of Business, 2011; (c) “Appointing Authority ” means the authority as mentioned in terms of\nreference of service for each | contractual employee as elaborated in\n\nSchedule-II; (d) “Committee” means any Committee constituted by the Director General for carrying out purposes of these Regulations; (e) “Contingent Paid Staff \" means a person who is temporarily hired , in\naccordance with the provisions of the relevant | policy of the Government ,\nfor performance of temporary duties, on latest minimum wage rate notified by Government of the Punjab; (f) “Contractual Employee” means an employee, staff or any other person recruited by the Authority through competitive process from the market on contractual basis as per the terms of reference of service for contractual employees as provided under Section 11 of the Act but excludes persons hired as Contingent Paid Staff and Interns; (g) “Directorate General ” means the Officer appointed as per provisions of Section 8 of the Act; (h) “Intern” means an individual engaged by the Authority for a short period to gain practical experience and skills in a relevant field, who may be paid an appropriate compensation and who shall not be deemed as employee of the Authority for the purposes of these Regulations;",
      "score": 0.14,
      "page_start": 328,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": true
    },
    {
      "text": "(i) “Organizational Structure ” means the organizational structure g iven in Schedule-I of these Regulations and includes employees, contractual employees and contingent paid staff; (j) “Recognized University ” means any University recognized by Higher Education Commission of Pakistan; (k) “Regulations” mean the Punjab Enforcement and Regulatory Authority (Appointment and Conditions of Service for Contractual Employees) Regulations, 2025; (l) “Schedule” means the Schedule(s) appended to these Regulations; (m) “SPPP” means Special Pay Package of PERA as detailed in Schedule-III. (n) “Terms of Reference of Service” means purpose of employ ment, job description, area of responsibility, qualification, experience, competence, personal attributes , pay and allo wances, other benefits and appointing authority.\n(2) | A word or expression used in the se Regulations but not defined shall have the same\nmeaning as assigned to it under the Act or under any other approved and notified Regulations of the Authority.\n\n3. Terms of Reference of Service for Contractual Employees: - Subject to provisions of\n\nthese Regulations, nomenclature of any position as well as minimum qualification, experience, competence and responsibilities for contractual employees shall be as specified in Schedule-II and the pay packages and any other admissible benefits shall be as provided in Schedule-III.\n\n4. Contractual Employment Committee: - For hiring of contractual employees of the\n\nAuthority in accordance with the organogram given in Schedule-I and as per Terms of Reference\nof Service as provided in Schedule -II, there shall be the | following Contractual Employment\nCommittee, with the below mentioned functions & TORs; which may be amended, from time to time, by the Director General, as per requirements:\n\na) Contractual Employment Committee:\ni. Director General, PERA - Chairman\n\nii. Director (Admin & HR), PERA | - Member\niii. Director / Head of relevant Wing of PERA - Member\niv. Deputy Director (Admin & HR), PERA | - Member/Secretary\n\nv. Any other co-opted Member(s)\nb) Functions / TORs:\ni. Conduct and supervise the recruitment process;\n\nii. Determine the staffing requirements in coordination with the Directors / Heads of relevant Wings of the Directorate General; iii. Review and finalize job descriptions, eligibility criteria, and selection criteria. iv. Approve and oversee the advertisement of positi ons through appropriate platforms;\n\nv. Scrutinize received applications to ensure completeness and eligibility;\n\nvi. Shortlist candidates in a transparent and merit -based manner on the basis of predefined criteria; vii. Document reasons for acceptance or rejection of applications; viii. Ensure integrity and fairness of all testing and interviewing processes; ix. Maintain confidentiality and impartiality during the evaluation process;",
      "score": 0.14,
      "page_start": 329,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": true
    },
    {
      "text": "x. Prepare a detailed hiring report / minutes including list of recommended\n\ncandidates, justification s for selection, and reserves or wait ing lists, if advised; xi. All such Committees shall be notified by the Director General for specific recruitment rounds or on a rolling basis, depending on hiring needs; xii. Meetings of the Committees shall be convened as per requirement; xiii. Quorum shall consist of a minimum of three members including the Chairpersons or their nominees; xiv. Develop IT/AI based turnkey solutions for efficient and effective hiring including applicant tracking systems or AI -supported screening tools, as deemed appropriate; xv. These TORs may be reviewed and amended periodically by the Director General to enhance recruitment efficacy;\nxvi. These functions / TORs | shall apply to all Committees constituted for\nemployment / recruitment of contractual, regular, or project-based staff across all grades / pay packages.\n(3) | The Director General may hire the services of consultant(s) / expert(s) of the relevant\nfield(s) for the purposes of selection of most suitable and competent HR, subject to observance of the Punjab Procurement Rules, 2014.\n(4) | The Authority, on the recommendation by the Director General, may exempt or relax any\nof the provision(s) of these Regulations, for the sake of effective administration.\n(5) | The Director General may transfer or post any contractual employee of the Authority,\nfrom one location to another, subject to the condition that such employee is placed in a position of similar nature, status, and responsibilities.\n\n(6) | All contractual employments of the Authority governed under these | Regulations shall\nalso be subject to | all other | notified Regulations of the Authority including but not limited | to\n\nService, Discipline, Performance Appraisal and Employees Welfare, with all due exceptions and exemptions.\n\n5. Duration and Renewal of Contract: (1) Consequent upon recommendations of the\n\nContractual Employment Committee, an employee shall be offered, initially, a contract for a period of two (02) years. (2) The Director General shall initiate a comprehensive review of the contractual employee’s performance, professional conduct, and compliance with organizational goals & objectives one (01) month prior to the conclusion of the contract period. The contract may, at the sole discretion of the Director General and subject to satisfactory performance, be renewed for a further period, as specified in such renewal. 6 Resignation: - (1) An employee may resign from service by giving one month ’s notice in writing to the Director General or deposit one month’s pay in lieu thereof and shall leave\nworkplace from date of acceptance of resignation provided he has cleared | all dues and\nobligations, including handover of official assets.\n(2) The Director General | may waive the notice period, upon the employee ’s request, if\nspecial circumstances exist and are recorded in writing. (3) The resignation shall not become effective unless accepted in writing by the Director General. 7 Termination of Service: - (1) The Director General may terminate , cancel, or rescind\nthe contract , after issuing three warning letters | on account of inefficiency , followed by one\nmonth's written notice. In case of misconduct, or contract breach, termination shall follow the",
      "score": 0.14,
      "page_start": 330,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": true
    },
    {
      "text": "Schedule-II Terms and Reference for Contractual Employment Position Title: - Chief Technology Officer (CTO)\nReport To: - | Director General, PERA\nWing: - | IT & Communication\nPurpose of the Position:\nCTO shall be responsible for providing technical leadership to the team of IT professionals. | He shall\nassist the Director General in ensuring the IT -enabled solutions for all functions of PERA including digitization of processes at the Headquarters and Enforcement Stations level. Areas of Responsibilities:\n Lead the IT & Communication Wing of PERA and responsible for development, deployment,\nupgradation, upscaling and troubleshooting of all IT-related technical applications | / software\nproducts.  Monitoring deliverables of software development of the projects by managing development lifecycle.  Responsible for all the activities of the software development team to ensure timely delivery and ensure they adhere to development international standards.  Monitor changes in the technology sector to discover ways organizations can improve and develop IT Infrastructure.  Research new technologies to strengthen the organization responsible for technology delivery.  Provide technical leadership to the team of professionals for Information Technology projects, infrastructure and data & cyber security to prevent security breaches and keep information confidential.  Develop, monitor and enhance an information security management framework.  Plan and direct the implementation of new IT infrastructure.  Identify areas and ways through which organization's technological assets can be improved.  Development & Management of MIS & GIS functions and its monitoring dashboards.  Ensure smooth electronic communication (connectivity and bandwidth) at multiple Government departments. Qualification and Experience:\ni MS or MPhi l. (First Division) in Computer Science , Software Engineering | or Information\nTechnology from a recognized University; and ii 10 years’ post qualification experience in the relevant field including at least four years’ experience in public sector. OR\ni Master’s degree or BS (First Division) in Computer Science , Software Engineering | or\nInformation Technology from a recognized University; and\nii 12 years’ post qualification experience in the | relevant field including at least five years’\nexperience in public sector. Note: Experience in private entities shall be accepted if such entity is registered with SECP, Registrar of Firms or any other Public Sector Regulatory Authority. Competencies & Personal Attributes:\n Strong leadership, team building and problem-solving abilities  Inquisitive and detailed oriented with strong analytical skills  Excellent communication skills, i.e. written and verbal Appointing Authority:\nAppointment shall be made by Director General on the recommendation s of the Contractual Employment Committee. Salary and Benefits:\nSPPP-1 + any other benefit admissible to SPPP-1 as mentioned in Schedule-III.",
      "score": 0.14,
      "page_start": 346,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": true
    },
    {
      "text": "Position Title: - Manager (Infrastructure & Networks)\nReport To: - | Chief Technology Officer (CTO)\nWing: - | IT & Communication\nPurpose of the Position:\nResponsible for maximizing the performance of IT infrastructure by directing the daily, weekly, and monthly activities. To provide leadership, motivation, training, and development of the workforce; process and procedure development to achieve operational excellence. Provide event driven operations monitoring, performance tracking and auditing capability. Areas of Responsibilities:\n Perform various IT Infrastructure Administration tasks including the following areas of responsibility:\n Data Centre Management  Core Network Infrastructure  Firewalls, Routers and Switches  Implement policies and procedures to meet service expectations and quality for Operations users through Firewall/Domain Controller.  Review the IT infrastructure to meet upcoming needs and expansion plans of the company.  Monitor network performance and optimize the network for optimal speed and availability.  Servers Management and their uptime assurance.  Deploy, configure, and update Domain Controller Group Policies.  Deploy, configure, and upgrade network software’s, such as enterprise antivirus or other remote support programs.  Installation of all types of updates like Windows 11, Windows Server 2016/2019/2022, Antivirus and Office 365 & MS Exchange Management.  Server and Network Equipment Management.  Plan, coordinate, and implement network security measures to protect IT Infrastructure from Internal/External attacks.  Responsible for Implementation of Policies, Procedures and SOPs.  Provide a high level of Technical Support to all Users.  Vendor Management with Procurement and Finance for their payments.  Procurement of IT Equipment & Services through Public Tenders with contracts.  Respond to Trouble tickets raised by Help Desk and is responsible for the resolution.  All IT Infra & systems admin istration functions like User Access control, Patch management, Virus Management, Spam Management, etc.  Coordination with Principals / Vendors on all IT related purchases including laying.  Manage staff and operations of data center Qualification and Experience:\ni Bachelor’s degree (Hons) in IT, Computer Sciences , Telecommunication | or Software\nEngineering or any other relevant / | similar degree from a recognized university; and\nii 5 years’ post qualification relevant experience including at least 3 years’ experience in public sector. Note: Experience in private entities shall be accepted if such entity is registered with SECP, Registrar of Firms or any other Public Sector Regulatory Authority. Competencies & Personal Attributes:\n A hands-on management approach that encourages change and creative problem-solving.  Ability to manage and maintain the operation of the data center and IT Infrastructure.  Ability to work well in a fast-paced and high-intensity environment.  Strong knowledge of Key Account Management.  Strong relationship-building skills.  Ability to groom.  Strong planning, execution, monitoring, and administrative skills.  Good knowledge of market trends of Technology.",
      "score": 0.14,
      "page_start": 349,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": true
    },
    {
      "text": "compensation for agility and expertise, and deputationists maintain their established remuneration with a small incentive. The HR and Finance Departments ensure that all salary payments are accurate, timely, and as per the sanctioned terms of appointment. 6.2 Annual Salary Increment PERA grants annual salary increments to reward employees for their continued service and to adjust for increased experience and seniority. The policy on annual increments differs slightly for different categories: • Regular (BPS) Employees & Deputationists: They will be entitled to adhoc increment as announced by Govt. of Punjab in annual budget. Further, annual increment admissible in December will be allowed strictly as per instructions of Govt. of Punjab. | • Contract Employees: Annual salary increment for contractual employees will be governed in the light of Regulation 16 of PERA (Performance Appraisal) Regulations, 2025. | All increments and pay increases are subject to budget availability and any instructions by the Finance Department. PERA will budget for annual increments as part of its yearly budgeting exercise. | In essence, annual increments serve to reward tenure and adjust pay for increased service. PERA adheres to the standardized approach for regular staff and endeavors to fairly extend similar treatment to contractual staff to maintain equity and motivation across the organization. 6.3 Gratuity The contractual employees of the Authority will be entitled to gratuity equal to one salary at the end of one completed year of their service at PERA. The gratuity at the time of termination of service shall be given to the employee along with his/her final settlement cheque after clearance from all relevant directorate/Departments in accordance with the prescribed exit procedure. An employee who terminates his/her employment or whose employment is terminated by the Authority, for any reason other than misconduct, shall be entitled to gratuity for every completed year of employment or any part thereof in excess of six months. However, payment of gratuity is subject to availability of budget under relevant head.",
      "score": 0.6045334219932557,
      "page_start": 460,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": false
    },
    {
      "text": "6.4 Honoraria PERA may grant honoraria to employees as a form of recognition or reward for exceptional performance, significant achievements, or on special occasions. These are discretionary rewards, not guaranteed entitlements. Employees will be awarded honorarium as per Punjab Enforcement & Regulatory Authority (Performance Appraisal) Regulations, 2025. | 6.5 Payroll Deductions Certain amounts may be deducted from an employee’s salary either due to legal requirements, employee enrollments in benefit programs, or specific situations like penalties or adjustments. PERA’s payroll system will ensure all deductions are transparent and appropriately authorized. The typical deductions that may appear on an employee’s payslip include: • Income Tax: Salaries are subject to withholding of income tax under the law. PERA, as an employer, will deduct income tax at source from monthly salaries in accordance with prevailing tax rates/slabs notified by the Federal Board of Revenue (FBR). The tax deduction is computed on the basis of the employee’s projected annual taxable income (salary plus any honoraria etc.) considering applicable exemptions or relief (like taxable income threshold). | • Provident Fund / Benevolent Fund: For regular and contractual employees, monthly deductions shall be made from their salary as determined by the Authority. These contributions will be credited to the employee’s provident fund or relevant account and payable upon retirement/separation as per applicable rules. The Directorate General retains full discretion to modify deduction rates, contribution structures, or eligibility criteria in accordance with organizational needs and regulatory frameworks. Voluntary additional contributions (if permitted) shall also be governed by the Authority’s prevailing policies. • Absent or Unpaid Leave Deductions: If an employee had any days of leave without pay or was absent without pay in a month, the proportional salary for those days will be deducted. Decision regarding deduction of salary will be taken by Director General at Directorate level and SDEO at Enforcement Station.",
      "score": 0.6030373573303223,
      "page_start": 461,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": false
    },
    {
      "text": "Appointment shall be made by the Director General on the recommendation of the Contractual Employment Committee. Salary and Benefits:\nSPPP-3 + any other benefit admissible to SPPP-3 as mentioned in Schedule-III.",
      "score": 0.6015208125114442,
      "page_start": 348,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": false
    },
    {
      "text": "Position Title: - Android Developer\nReport To: - | Manager Development\nWing: - | IT & Communication\nPurpose of the Position:\nThe Android Developer designs, develops, and maintains high-performance Android applications. This role involves working with Kotlin/Java, modern Android frameworks, and best practices to create scalable, secure, and user-friendly mobile apps. Areas of Responsibilities:\n Experience in Design, Illustrator, Dreamweaver, Photoshop, Figma, Adobe XD etc. Should be well versed in HTML, CSS, Bootstrap and jQuery.  Conduct usability for android apps, testing to gather feedback and make improvements to designs.  Ability to be able to form, prototype and confidently present ideas.  Design and build native Android applications using Kotlin (preferred) or Java.  Implement Jetpack components (ViewModel, LiveData, Room, Compose).  Ensure responsive UI/UX with Material Design guidelines.  Optimize apps for performance, battery efficiency, and memory usage.  Connect Android apps to RESTful APIs (Retrofit, OkHttp).  Handle authentication (OAuth, JWT, Firebase Auth).  Work with real-time data (WebSockets, Firebase Realtime DB).  Write unit tests & UI tests (JUnit, Espresso, Mockito).  Debug and fix crashes using Android Studio, Logcat, and Firebase Crashlytics.  Conduct performance profiling (Android Profiler, Systrace).  Keep apps updated with the latest Android SDK & security patches.  Reduce APK size and improve load times.  Support different screen sizes, OS versions, and devices.  Work with cross-functional teams (Backend, UX/UI, QA).  Follow Agile/Scrum methodologies (sprints, code reviews).  Stay updated with Android trends (Jetpack updates, new APIs). Qualification and Experience:\ni Bachelor’s degree (Hons) in IT, Computer Sciences or Software Engineering or any | other\nrelevant / | similar degree from a recognized university; and\nii 3 years’ post qualification experience in the relevant field including at least one years’ experience in public sector. Note: Experience in private entities shall be accepted if such entity is registered with SECP, Registrar of Firms or any other Public Sector Regulatory Authority. Competencies & Personal Attributes:\n A hands-on management approach that encourages change and creative problem-solving.  Ability to manage and maintain the operation of the data center and IT Networks.  Ability to work well in a fast-paced and high-intensity environment.  Strong relationship-building skills.  Good knowledge of market trends of Technology. Appointment:\nAppointment shall be made by Director General on the recommendation s of the Contractual Employment Committee. Salary and Benefits:\nSPPP-4 + any other benefit admissible to SPPP-4 as mentioned in Schedule-III",
      "score": 0.6009105980396271,
      "page_start": 355,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": false
    },
    {
      "text": " Strong Knowledge of Contract Management Appointment:\nAppointment shall be made by the Director General on the recommendation of Contractual Employment Committee. Salary and Benefits:\nSPPP-3 + any other benefit admissible to SPPP-3 as mentioned in Schedule-III.",
      "score": 0.6008265137672425,
      "page_start": 350,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": false
    },
    {
      "text": "Position Title: - Assistant Manager (Network)\nReport To: - | Manager (Infrastructure & Networks)\nWing: - | IT & Communication\nPurpose of the Position:\nResponsible for maximizing the performance of IT Networks and provide, training, and development of the workforce; process and procedure development to achieve operational excellence. Areas of Responsibilities:\n To assist to perform various IT Network Administration tasks including the following areas of responsibility:\n Data Centre Management  Core Network Infrastructure  Firewalls, Routers and Switches  Implement policies and procedures to meet service expectatio ns and quality for Operations through Firewall/Domain Controller.  Monitor network performance and optimize the network for optimal speed and availability.  Servers Management and their uptime assurance.  Deploy, configure, and update Domain Controller Group Policies.  Deploy, configure, and upgrade network software’s, such as enterprise antivirus or other remote support programs.  Installation of all types of updates like Windows 11, Windows Server 2016/2019/2022, Antivirus and Office 365 & MS Exchange Management.  Server and Network Equipment Management.  Responsible for Implementation of Policies, Procedures and SOPs.  Provide a high level of Technical Support to all Users.  Respond to Trouble tickets raised by Help Desk and is responsible for the resolution.  All IT Infra & systems administration functions like User Access control, Patch management, Virus Management, Spam Management, etc. Qualification and Experience:\ni Bachelor’s degree (Hons) in IT, Computer Sciences , Telecommunication or Software\nEngineering or any other relevant / | similar degree from a recognized university; and\nii 3 years’ post qualification experience in the relevant field including at least two years’ experience in public sector. Note: Experience in private entities shall be accepted if such entity is registered with SECP, Registrar of Firms or any other Public Sector Regulatory Authority. Competencies & Personal Attributes:\n A hands-on management approach that encourages change and creative problem-solving.  Ability to manage and maintain the operation of the data center and IT Networks.  Ability to work well in a fast-paced and high-intensity environment.  Strong relationship-building skills.  Good knowledge of market trends of Technology. Appointment:\nAppointment shall be made by Director General on the recommendation of Contractual Employment Committee. Salary and Benefits:\nSPPP-5 + any other benefit admissible to SPPP-5 as mentioned in Schedule-III",
      "score": 0.6004858791828156,
      "page_start": 352,
      "public_path": "/assets/data/Compiled Working Paper_2nd Meeting PERA 03-07-2025.pdf",
      "_is_smart_context": false
    }
  ]
}